[MainMissions.M_DLC4_OTCT_Phase2 MissionDefinition]
MissionDescription="Just what we need: more claptraps.  Invade the rogue claptrap factory in Dividing Faults and bring the damn thing down around those buckets of bolts."
MissionGiver="Blake"
MissionName="Operation Trap Claptrap Trap, Phase Two: Industrial Revolution"
MissionSummary="Find and destroy the factory creating claptraps."
Objectives[0]=(ProgressMessage="Factory located:")
Objectives[1]=(ProgressMessage="Coolant pumps destroyed:")
TurnInDescription="Murder, mayhem, and some light industrial espionage.  All in a day's work for a corporate raider like yourself. Now to Phase Three..."

[SideMissions.M_DLC4_DFault MissionDefinition]
MissionDescription="The vicious D-Fault and his gang have been harassing tour buses in the Dividing Faults.  Hyperion needs them taken out to keep that tourist cash coming in."
MissionGiver="Hyperion Tourist Information Board"
MissionName="Not My Fault"
MissionSummary="Kill 15 D-Fault bandits and their leader D-Fault."
Objectives[0]=(ProgressMessage="D-Fault bandits killed:")
Objectives[1]=(ProgressMessage="D-Fault killed:")
TurnInDescription="The Dividing Faults are safe for tourists once more, and if you look out the left side of the bus, you can see a pile of fresh corpses."

[SideMissions.M_DLC4_TakingStock MissionDefinition]
MissionDescription="Marcus' stockroom is running dangerously low on useless touristy crap.  Find ten handsome bobble-heads around the Hyperion factory complex in Dividing Faults and bring them back to Marcus for a handsome reward."
MissionGiver="Marcus"
MissionName="Taking Stock"
MissionSummary="Collect 10 bobble-heads for Marcus."
Objectives[0]=(ProgressMessage="Bobble-heads:")
TurnInDescription="Marcus' bobble-head supply is completely restocked. The dashboards of Pandora will not go unfurnished!"

